# AnalyticalModelIsIncorrect Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AnalyticalModelFailures..::..AnalyticalModelIsIncorrect Property
BuiltInFailures..::..AnalyticalModelFailures Class See Also
---
Analytical Model is not created for the structural element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AnalyticalModelIsIncorrect { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticalModelIsIncorrect As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AnalyticalModelIsIncorrect {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace